src/test/resources/com/zuora/opg/test/json/stripe_2/bankTransfer/payment/case_01/payment_response.json

{
  "id":"pi_3MvJQpHo3zohLKRe1nK4BOTd",
  "object":"payment_intent",
  "amount":76650,
  "amount_capturable":0,
  "amount_details":{
    "tip":{

    }
  },
  "amount_received":0,
  "application":"ca_InA7ApUuorLyOoc9wXZ26UAGjunWN7rq",
  "application_fee_amount":null,
  "automatic_payment_methods":null,
  "canceled_at":null,
  "cancellation_reason":null,
  "capture_method":"automatic",
  "charges":{
    "object":"list",
    "data":[
      {
        "id":"py_3MvJQpHo3zohLKRe1d5xR8eZ",
        "object":"charge",
        "amount":76650,
        "amount_captured":76650,
        "amount_refunded":0,
        "application":"ca_InA7ApUuorLyOoc9wXZ26UAGjunWN7rq",
        "application_fee":null,
        "application_fee_amount":null,
        "balance_transaction":"txn_3MvJQpHo3zohLKRe198uVA74",
        "billing_details":{
          "address":{
            "city":null,
            "country":null,
            "line1":null,
            "line2":null,
            "postal_code":null,
            "state":null
          },
          "email":null,
          "name":null,
          "phone":null
        },
        "calculated_statement_descriptor":null,
        "captured":true,
        "created":1681128167,
        "currency":"usd",
        "customer":"cus_MuRd89riAKPu3u",
        "description":null,
        "destination":null,
        "dispute":null,
        "disputed":false,
        "failure_balance_transaction":null,
        "failure_code":null,
        "failure_message":null,
        "fraud_details":{

        },
        "invoice":null,
        "livemode":true,
        "metadata":{
          "zpayment_number":"P-00343510"
        },
        "on_behalf_of":null,
        "order":null,
        "outcome":{
          "network_advice_code":null,
          "network_decline_code":null,
          "network_status":"approved_by_network",
          "reason":null,
          "risk_level":"not_assessed",
          "seller_message":"Payment complete.",
          "type":"authorized"
        },
        "paid":false,
        "payment_intent":"pi_3MvJQpHo3zohLKRe1nK4BOTd",
        "payment_method":null,
        "payment_method_details":{
          "ach_debit":{
            "account_holder_type":"individual",
            "bank_name":"UMB, NA",
            "country":"US",
            "fingerprint":"raGXyFvK0lnpMIch",
            "last4":"3167",
            "routing_number":"044000804"
          },
          "type":"ach_debit"
        },
        "receipt_email":null,
        "receipt_number":null,
        "receipt_url":null,
        "refunded":false,
        "refunds":{
          "object":"list",
          "data":[

          ],
          "has_more":false,
          "total_count":0,
          "url":"/v1/charges/py_3MvJQpHo3zohLKRe1d5xR8eZ/refunds"
        },
        "review":null,
        "shipping":null,
        "source":{
          "id":"ba_1MAcjnHo3zohLKRe4Quaahlk",
          "object":"bank_account",
          "account_holder_name":"ContainIQ, Inc.",
          "account_holder_type":"individual",
          "account_type":null,
          "bank_name":"UMB, NA",
          "country":"US",
          "currency":"usd",
          "customer":"cus_MuRd89riAKPu3u",
          "fingerprint":"raGXyFvK0lnpMIch",
          "last4":"3167",
          "metadata":{

          },
          "routing_number":"044000804",
          "status":"verified"
        },
        "source_transfer":null,
        "statement_descriptor":null,
        "statement_descriptor_suffix":null,
        "status":"pending",
        "transfer_data":null,
        "transfer_group":null
      }
    ],
    "has_more":false,
    "total_count":1,
    "url":"/v1/charges?payment_intent=pi_3MvJQpHo3zohLKRe1nK4BOTd"
  },
  "client_secret":"pi_3MvJQpHo3zohLKRe1nK4BOTd_secret_5MEpGDsjJf6VQEwgzuDNieusQ",
  "confirmation_method":"automatic",
  "created":1681128167,
  "currency":"usd",
  "customer":"cus_MuRd89riAKPu3u",
  "description":null,
  "invoice":null,
  "last_payment_error":null,
  "latest_charge":"py_3MvJQpHo3zohLKRe1d5xR8eZ",
  "level3":null,
  "livemode":true,
  "metadata":{
    "zpayment_number":"P-00343510"
  },
  "next_action":null,
  "on_behalf_of":null,
  "payment_method":null,
  "payment_method_options":{

  },
  "payment_method_types":[
    "ach_debit"
  ],
  "processing":null,
  "receipt_email":null,
  "review":null,
  "setup_future_usage":null,
  "shipping":null,
  "source":"ba_1MAcjnHo3zohLKRe4Quaahlk",
  "statement_descriptor":null,
  "statement_descriptor_suffix":null,
  "status":"processing",
  "transfer_data":null,
  "transfer_group":null
}