src/test/resources/com/zuora/opg/test/json/stripe_2/bankTransfer/payment/case_03/payment_response.json

{ "id": "pi_3NvwQy4ZWiZesCzm1wjH1fWW", "object": "payment_intent", "amount": 1000, "amount_capturable": 0, "amount_details": { "tip": {} }, "amount_received": 0, "application": null, "application_fee_amount": null, "automatic_payment_methods": null, "canceled_at": null, "cancellation_reason": null, "capture_method": "automatic", "charges": { "object": "list", "data": [ { "id": "py_3NvwQy4ZWiZesCzm1eZoYUyL", "object": "charge", "amount": 1000, "amount_captured": 1000, "amount_refunded": 0, "application": null, "application_fee": null, "application_fee_amount": null, "balance_transaction": null, "billing_details": { "address": { "city": "Fremont", "country": "GB", "line1": "region active", "line2": null, "postal_code": "94020", "state": null }, "email": "1@126.com", "name": "seed", "phone": null }, "calculated_statement_descriptor": null, "captured": true, "created": 1696054428, "currency": "gbp", "customer": "cus_OjPDx52Y6gedpQ", "description": null, "destination": null, "dispute": null, "disputed": false, "failure_balance_transaction": null, "failure_code": null, "failure_message": null, "fraud_details": {}, "invoice": null, "livemode": false, "metadata": { "zpayment_number": "P-00000081" }, "on_behalf_of": null, "order": null, "outcome": { "network_advice_code": null, "network_decline_code": null, "network_status": "approved_by_network", "reason": null, "risk_level": "not_assessed", "seller_message": "Payment complete.", "type": "authorized" }, "paid": false, "payment_intent": "pi_3NvwQy4ZWiZesCzm1wjH1fWW", "payment_method": "pm_1NvwP24ZWiZesCzm10iDDGRI", "payment_method_details": { "bacs_debit": { "fingerprint": "yTeZDXlMu515zsVG", "last4": "2345", "mandate": "mandate_1NvwP24ZWiZesCzmW5kbqqiY", "sort_code": "108800" }, "type": "bacs_debit" }, "receipt_email": null, "receipt_number": null, "receipt_url": null, "refunded": false, "refunds": { "object": "list", "data": [], "has_more": false, "total_count": 0, "url": "/v1/charges/py_3NvwQy4ZWiZesCzm1eZoYUyL/refunds" }, "review": null, "shipping": null, "source": null, "source_transfer": null, "statement_descriptor": null, "statement_descriptor_suffix": null, "status": "pending", "transfer_data": null, "transfer_group": null } ], "has_more": false, "total_count": 1, "url": "/v1/charges?payment_intent=pi_3NvwQy4ZWiZesCzm1wjH1fWW" }, "client_secret": "pi_3NvwQy4ZWiZesCzm1wjH1fWW_secret_AdBjZ6Kx0zc5gnVRT9MhfxCCN", "confirmation_method": "automatic", "created": 1696054428, "currency": "gbp", "customer": "cus_OjPDx52Y6gedpQ", "description": null, "invoice": null, "last_payment_error": null, "latest_charge": "py_3NvwQy4ZWiZesCzm1eZoYUyL", "level3": null, "livemode": false, "metadata": { "zpayment_number": "P-00000081" }, "next_action": null, "on_behalf_of": null, "payment_method": "pm_1NvwP24ZWiZesCzm10iDDGRI", "payment_method_configuration_details": null, "payment_method_options": { "bacs_debit": {} }, "payment_method_types": [ "bacs_debit" ], "processing": null, "receipt_email": null, "review": null, "setup_future_usage": null, "shipping": null, "source": null, "statement_descriptor": null, "statement_descriptor_suffix": null, "status": "processing", "transfer_data": null, "transfer_group": null }